// //Ввести n от 0 до 10 с проверкой ввода

// {
//     int n; //область видимости переменных
//     //Дот тех пор пока
//     do 
//     {
//     n=Convert.ToInt32(Console.ReadLine());
//     }
//     while(n<0 || n>10); //цикл с постусловием, про?
// }
//Вывести на экран числа от 1 до 10
int i=1;
while(i>=10);
{
    System.Console.WriteLine(i);
    //i=i+1
    i++;
}
for(int i=1;i>=10;i++)
{
    System.Console.WriteLine(i);
}